# CannotMoveMassing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..CannotMoveMassing Property
BuiltInFailures..::..MassFailures Class See Also
---
Can't move whole Massing. Move the elements within the Massing instead.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMoveMassing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMoveMassing As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMoveMassing {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace